export const categories = [
  {
    id: 'greetings',
    name: '인사 및 감사',
    words: [
      '감사합니다',
      '만나서 반갑습니다',
      '안녕',
      '잘 부탁드립니다',
      '수고하셨습니다',
    ],
  },
  {
    id: 'emotions',
    name: '감정 표현',
    words: [
      '기쁘다',
      '사랑해',
      '싫어요',
      '화나다',
      '괜찮아',
      '좋아해',
      '축하해',
      '미안해',
    ],
  },
  {
    id: 'states',
    name: '상태 및 상황',
    words: [
      '바쁘다',
      '아프다',
      '맛있다',
      '예쁘다',
    ],
  },
  {
    id: 'time',
    name: '시간 관련',
    words: [
      '오늘',
      '내일',
      '어제',
    ],
  },
  {
    id: 'places',
    name: '장소',
    words: [
      '집',
      '병원',
      '학교',
      '회사',
    ],
  },
  {
    id: 'questions',
    name: '의문문',
    words: [
      '얼마에요(의문문)',
      '필요한 것 있으세요(의문문)',
      '이름이 무엇입니까?(의문문)',
    ],
  },
  {
    id: 'others',
    name: '기타',
    words: [
      '잠시만 기다려주세요',
      '알겠어요',
      '메리 크리스마스',
    ],
  },
]; 